In [1]:
#PANDAS

In [2]:
#Checking version
import pandas
pandas.__version__

'1.0.5'

In [3]:
import numpy as np
import pandas as pd

In [4]:
#PANDAS OBJECTS

In [5]:
#SERIES
num = pd.Series([11, 22, 33, 44])
num

0    11
1    22
2    33
3    44
dtype: int64

In [6]:
num.values

array([11, 22, 33, 44], dtype=int64)

In [7]:
num.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
#assigning the lables to index
num = pd.Series([11, 22, 33, 44], 
    index=['jenni', 'piggy', 'tharu', 'teju'])
num

jenni    11
piggy    22
tharu    33
teju     44
dtype: int64

In [9]:
num['tharu']

33

In [10]:
num[3]

44

In [11]:
num.name = 'num'
num.index.name = 'Students'
num

Students
jenni    11
piggy    22
tharu    33
teju     44
Name: num, dtype: int64

In [12]:
#Can also apply other operations
np.log(num)

Students
jenni    2.397895
piggy    3.091042
tharu    3.496508
teju     3.784190
Name: num, dtype: float64

In [13]:
num[num>33]

Students
teju    44
Name: num, dtype: int64

In [14]:
num_dict = {'jenni': 11, 'piggy': 22, 'tharu': 33, 'teju': 44}
print(num_dict)
pd.Series(num_dict)

{'jenni': 11, 'piggy': 22, 'tharu': 33, 'teju': 44}

jenni    11
piggy    22
tharu    33
teju     44
dtype: int64

In [15]:
#DATA FRAME
CMR = {"students": ["nayana", "tharu", "teju", "piggy", "jenni", "maha"],
        "batch": [2015, 2016, 2017, 2018, 2019, 2020],
        "id": [111, 222, 333, 444, 555, 666]}
print(CMR)
CMR = pd.DataFrame(CMR)
CMR

{'students': ['nayana', 'tharu', 'teju', 'piggy', 'jenni', 'maha'], 'batch': [2015, 2016, 2017, 2018, 2019, 2020], 'id': [111, 222, 333, 444, 555, 666]}

  students  batch   id
0   nayana   2015  111
1    tharu   2016  222
2     teju   2017  333
3    piggy   2018  444
4    jenni   2019  555
5     maha   2020  666

In [16]:
data = pd.DataFrame(CMR, columns=["students", "id" ,"batch"])
data

  students   id  batch
0   nayana  111   2015
1    tharu  222   2016
2     teju  333   2017
3    piggy  444   2018
4    jenni  555   2019
5     maha  666   2020

In [17]:
#Assigning values to new columns 
data['marks'] = data.batch / data.id
data

  students   id  batch      marks
0   nayana  111   2015  18.153153
1    tharu  222   2016   9.081081
2     teju  333   2017   6.057057
3    piggy  444   2018   4.545045
4    jenni  555   2019   3.637838
5     maha  666   2020   3.033033

In [18]:
data['count'] = pd.Series(range(6), index=[0, 1, 2, 3, 4, 5])
data

  students   id  batch      marks  count
0   nayana  111   2015  18.153153      0
1    tharu  222   2016   9.081081      1
2     teju  333   2017   6.057057      2
3    piggy  444   2018   4.545045      3
4    jenni  555   2019   3.637838      4
5     maha  666   2020   3.033033      5

In [19]:
data.to_dict()

{'students': {0: 'nayana',
  1: 'tharu',
  2: 'teju',
  3: 'piggy',
  4: 'jenni',
  5: 'maha'},
 'id': {0: 111, 1: 222, 2: 333, 3: 444, 4: 555, 5: 666},
 'batch': {0: 2015, 1: 2016, 2: 2017, 3: 2018, 4: 2019, 5: 2020},
 'marks': {0: 18.153153153153152,
  1: 9.08108108108108,
  2: 6.057057057057057,
  3: 4.545045045045045,
  4: 3.637837837837838,
  5: 3.033033033033033},
 'count': {0: 0, 1: 1, 2: 2, 3: 3, 4: 4, 5: 5}}

In [20]:
pd.DataFrame(data.to_dict())

  students   id  batch      marks  count
0   nayana  111   2015  18.153153      0
1    tharu  222   2016   9.081081      1
2     teju  333   2017   6.057057      2
3    piggy  444   2018   4.545045      3
4    jenni  555   2019   3.637838      4
5     maha  666   2020   3.033033      5

In [21]:
air = [{'n': i, 'm':5* i}for i in range(5)]
print(air)
pd.DataFrame(air)

[{'n': 0, 'm': 0}, {'n': 1, 'm': 5}, {'n': 2, 'm': 10}, {'n': 3, 'm': 15}, {'n': 4, 'm': 20}]

   n   m
0  0   0
1  1   5
2  2  10
3  3  15
4  4  20

In [22]:
#NAN
pd.DataFrame([{'ll': 9, 'mm': 4}, {'ll': 3, 'nn': 8}])

   ll   mm   nn
0   9  4.0  NaN
1   3  NaN  8.0

In [23]:
#2d numpy array
pd.DataFrame(np.random.randint(3, 18),
             columns=['apple', 'mango'],
             index=['a', 'b', 'c'])

   apple  mango
a      7      7
b      7      7
c      7      7

In [24]:
#INDEX
mom = pd.Index([22, 33, 44, 55, 66])
mom

Int64Index([22, 33, 44, 55, 66], dtype='int64')

In [25]:
mom[1]

33

In [26]:
mom[2:4:]

Int64Index([44, 55], dtype='int64')

In [27]:
mom[::]

Int64Index([22, 33, 44, 55, 66], dtype='int64')

In [28]:
print(mom.size, mom.shape, mom.ndim, mom.dtype)

5 (5,) 1 int64

In [29]:
#Operating on Data in Pandas
dad = np.random.RandomState(10)
s = pd.Series(dad.randint(0, 12, 5))
s

0     9
1     4
2     0
3     1
4    11
dtype: int32

In [30]:
cat = pd.DataFrame(dad.randint(0, 12, (4, 5)),
                  columns=['A', 'B', 'C', 'D', 'E'])
cat

   A  B   C   D   E
0  9  0   1  10   8
1  9  0  10   8   6
2  4  3   0   4  11
3  6  8  11  10   1

In [31]:
np.exp(s)

0     8103.083928
1       54.598150
2        1.000000
3        2.718282
4    59874.141715
dtype: float64

In [32]:
np.sin(cat* np.pi / 4)

              A             B         C             D             E
0  7.071068e-01  0.000000e+00  0.707107  1.000000e+00 -2.449294e-16
1  7.071068e-01  0.000000e+00  1.000000 -2.449294e-16 -1.000000e+00
2  1.224647e-16  7.071068e-01  0.000000  1.224647e-16  7.071068e-01
3 -1.000000e+00 -2.449294e-16  0.707107  1.000000e+00  7.071068e-01

In [33]:
#Index alignment in Series
nf = pd.Series({'delhi': 1234, 'mumbai': 5678,
                  'coorg': 423967}, name='place')
nff = pd.Series({'mumbai': 38332521, 'coorg': 26448193,
                        'banglore': 19651127}, name='cities')
print(nf)
nff

delhi       1234
mumbai      5678
coorg     423967
Name: place, dtype: int64

mumbai      38332521
coorg       26448193
banglore    19651127
Name: cities, dtype: int64

In [34]:
nf / nff

banglore         NaN
coorg       0.016030
delhi            NaN
mumbai      0.000148
dtype: float64

In [35]:
p = pd.Series([1, 2, 3], index=[0, 1, 2])
t = pd.Series([6, 3, 5], index=[0, 2, 3])
print(p)
print(t)
p + t

0    1
1    2
2    3
dtype: int64
0    6
2    3
3    5
dtype: int64

0    7.0
1    NaN
2    6.0
3    NaN
dtype: float64

In [36]:
p.add(t, fill_value=9)

0     7.0
1    11.0
2     6.0
3    14.0
dtype: float64

In [37]:
#Merge operations
data

  students   id  batch      marks  count
0   nayana  111   2015  18.153153      0
1    tharu  222   2016   9.081081      1
2     teju  333   2017   6.057057      2
3    piggy  444   2018   4.545045      3
4    jenni  555   2019   3.637838      4
5     maha  666   2020   3.033033      5

In [38]:
newdata = pd.DataFrame({"students": ["nayana", "tharu", "jenni"], "ph.no": ["000000", "1111111", "333333"]})
newdata

  students    ph.no
0   nayana   000000
1    tharu  1111111
2    jenni   333333

In [39]:
data.merge(newdata)

  students   id  batch      marks  count    ph.no
0   nayana  111   2015  18.153153      0   000000
1    tharu  222   2016   9.081081      1  1111111
2    jenni  555   2019   3.637838      4   333333

In [40]:
nd1 = pd.DataFrame({"students": ["tharu", "jenni"], "ph.no": ["1111111", "3333333"]})
nd1
data.merge(nd1, right_on='students', left_on='students')

  students   id  batch     marks  count    ph.no
0    tharu  222   2016  9.081081      1  1111111
1    jenni  555   2019  3.637838      4  3333333

In [41]:
nd2 = pd.DataFrame({"students": ["piggy", "maha", "tharu"], "ph.no": ["444444", "333333", "6666666"]})
data.merge(nd2, how='outer')

  students   id  batch      marks  count    ph.no
0   nayana  111   2015  18.153153      0      NaN
1    tharu  222   2016   9.081081      1  6666666
2     teju  333   2017   6.057057      2      NaN
3    piggy  444   2018   4.545045      3   444444
4    jenni  555   2019   3.637838      4      NaN
5     maha  666   2020   3.033033      5   333333

In [42]:
nd3 = pd.DataFrame({"students": ["nayana", "tharu", "jenni"], "ph.no": ["999999", "555555", "6666666"]})
print(data)
data.merge(nd3, how='outer')

  students   id  batch      marks  count
0   nayana  111   2015  18.153153      0
1    tharu  222   2016   9.081081      1
2     teju  333   2017   6.057057      2
3    piggy  444   2018   4.545045      3
4    jenni  555   2019   3.637838      4
5     maha  666   2020   3.033033      5

  students   id  batch      marks  count    ph.no
0   nayana  111   2015  18.153153      0   999999
1    tharu  222   2016   9.081081      1   555555
2     teju  333   2017   6.057057      2      NaN
3    piggy  444   2018   4.545045      3      NaN
4    jenni  555   2019   3.637838      4  6666666
5     maha  666   2020   3.033033      5      NaN

In [43]:
#Combining data with overlap
monkey = pd.Series(['cat', 2.5, 8.6, 'lion', 4.5, np.nan, np.nan, np.nan],
                     index=['1', '2', '3', '4', '5', '6', '7', '8'])
donkey = pd.Series(np.arange(len(monkey), dtype=np.float64),
                 index=['1', '2', '3', '4', '5', '6', '7', '8'])

In [44]:
monkey

1     cat
2     2.5
3     8.6
4    lion
5     4.5
6     NaN
7     NaN
8     NaN
dtype: object

In [45]:
donkey

1    0.0
2    1.0
3    2.0
4    3.0
5    4.0
6    5.0
7    6.0
8    7.0
dtype: float64

In [46]:
pd.Series(np.where(pd.isnull(monkey), donkey, monkey), index=monkey.index)

1     cat
2     2.5
3     8.6
4    lion
5     4.5
6       5
7       6
8       7
dtype: object

In [47]:
#shortcut
monkey.combine_first(donkey)

1     cat
2     2.5
3     8.6
4    lion
5     4.5
6       5
7       6
8       7
dtype: object